In [1]:
import pandas as pd

**Task 1**

In [2]:
authors = pd.DataFrame({
                'author_id':[1, 2, 3],
                'author_name':['Тургенев', 'Чехов', 'Островский']
                }, columns = ['author_id', 'author_name'])

In [3]:
authors.head()

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290]}
                    ,columns = ['author_id', 'book_title', 'price'])

In [5]:
book.head(10)

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

**Taks 2**

In [6]:
authors_price = pd.merge(authors, book, on = 'author_id', how='inner')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

**Task 3**

In [8]:
top_5 = authors_price.sort_values(by='price', ascending=False).iloc[0:5, :].reset_index(drop=True)

In [9]:
top_5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

In [10]:
top_5_01 = authors_price.nlargest(5, 'price')

variant 2

In [11]:
top_5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

**Task 4**

*variant 1*

In [25]:
authors_stat = authors_price[['author_name', 'price']]

In [26]:
max_price = pd.DataFrame(authors_stat.groupby('author_name')['price'].max())
max_price = max_price.rename(columns={'price':'max_price'})

In [27]:
min_price = pd.DataFrame(authors_stat.groupby('author_name')['price'].min())
min_price = min_price.rename(columns={'price':'min_price'})

In [28]:
mean_price = pd.DataFrame(authors_stat.groupby('author_name')['price'].mean())
mean_price = mean_price.rename(columns={'price':'mean_price'})

In [29]:
authors_stat = pd.concat([max_price, min_price, mean_price], axis = 1 )

In [30]:
authors_stat.reset_index(inplace = True) 
authors_stat

  author_name  max_price  min_price  mean_price
0  Островский        370        290  330.000000
1    Тургенев        450        300  366.666667
2       Чехов        500        450  475.000000


*variant 2*

In [55]:
authors_stat = authors_price.groupby('author_name', as_index = False)\
            .agg({"price":["max","min","mean"]})\
            .rename(columns = {'max':'max_price', 'min':'min_price', 'mean':'mean_price'})

In [53]:
authors_stat

  author_name     price
              max_price min_price  mean_price
0  Островский       370       290  330.000000
1    Тургенев       450       300  366.666667
2       Чехов       500       450  475.000000

*just to flatten column names*

In [63]:
authors_stat.columns = authors_stat.columns.to_flat_index()

In [68]:
authors_stat

  (author_name, )  (price, max_price)  (price, min_price)  (price, mean_price)
0      Островский                 370                 290           330.000000
1        Тургенев                 450                 300           366.666667
2           Чехов                 500                 450           475.000000